* Ссылки [[~/org/sbcl/sbcl-referencies.org][Ссылки]]
 
* Генерирование документации
#+name: codex
#+BEGIN_SRC lisp
  (loop
    :for i :in
    '((:math           :math)
      (:math/core       nil)
      (:math/smooth     nil)
      (:math/list-matr  nil)
      (:math/arr-matr   nil)
      (:math/appr       nil)
      (:math/stat       nil)
      (:math/coord      nil)
      (:math/gnuplot    nil)
      (:math/x-o        nil)
      )
    :do (mnas-package:document (first i) (second i)))
  (codex:document :math)
#+END_SRC

#+name: graphs
#+BEGIN_SRC lisp :var codex=codex
  (loop
    :for i :in
    '(:math
      :math/core
      :math/smooth
      :math/list-matr
      :math/arr-matr
      :math/appr
      :math/stat
      :math/coord
      :math/gnuplot
      :math/x-o)
    :do (mnas-package:make-codex-graphs i i))
#+END_SRC

#+RESULTS: graphs
: NIL

* Публикация
#+name: publish
#+BEGIN_SRC shell :var graphs=graphs
    mkdir -p "$HOME/public_html/Common-Lisp-Programs/"
    CDIR=`dirname $PWD | xargs basename`
    rsync -Pazh --delete ../docs/build/$CDIR/html/ $HOME/public_html/Common-Lisp-Programs/$CDIR 
    if [[ `hostname` == "mnasoft-00" ]]
    then
	echo "mnasoft-00"
  #     sh ~/bin/pi-html
    fi
    if [[ `hostname` == "N118383" ]]
    then
	echo "N118383"
        CPL="//n133619/home/_namatv/public_html/Site/Development/Common-Lisp-Programs"
	mkdir -p $CPL/$CDIR
	rsync -Pazh --delete ../docs/build/$CDIR/html/ $CPL/$CDIR
     fi
#+END_SRC

#+RESULTS: publish
| sending                            | incremental                           | file | list       |         |   |         |      |            |         |           |                 |
| deleting                           | comparison-of-smoothing-functions.png |      |            |         |   |         |      |            |         |           |                 |
| ./                                 |                                       |      |            |         |   |         |      |            |         |           |                 |
| 0-обзор.html                       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.69K                                 | 100% | 0.00kB/s   | 0:00:00 |   | 6.69K   | 100% | 0.00kB/s   | 0:00:00 | (xfr#1,   | to-chk=111/113) |
| 10-обзор.html                      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.76K                                 | 100% | 6.45MB/s   | 0:00:00 |   | 6.76K   | 100% | 6.45MB/s   | 0:00:00 | (xfr#2,   | to-chk=110/113) |
| 15-обзор.html                      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.72K                                 | 100% | 6.41MB/s   | 0:00:00 |   | 6.72K   | 100% | 6.41MB/s   | 0:00:00 | (xfr#3,   | to-chk=109/113) |
| 21-обзор.html                      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.99K                                 | 100% | 6.67MB/s   | 0:00:00 |   | 6.99K   | 100% | 6.67MB/s   | 0:00:00 | (xfr#4,   | to-chk=108/113) |
| 23-обзор.html                      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.86K                                 | 100% | 6.54MB/s   | 0:00:00 |   | 6.86K   | 100% | 6.54MB/s   | 0:00:00 | (xfr#5,   | to-chk=107/113) |
| 27-обзор.html                      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.87K                                 | 100% | 6.55MB/s   | 0:00:00 |   | 6.87K   | 100% | 6.55MB/s   | 0:00:00 | (xfr#6,   | to-chk=106/113) |
| 4-обзор.html                       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.59K                                 | 100% | 6.29MB/s   | 0:00:00 |   | 6.59K   | 100% | 6.29MB/s   | 0:00:00 | (xfr#7,   | to-chk=105/113) |
| 6-обзор.html                       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.66K                                 | 100% | 6.35MB/s   | 0:00:00 |   | 6.66K   | 100% | 6.35MB/s   | 0:00:00 | (xfr#8,   | to-chk=104/113) |
| 8-обзор.html                       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.76K                                 | 100% | 6.45MB/s   | 0:00:00 |   | 6.76K   | 100% | 6.45MB/s   | 0:00:00 | (xfr#9,   | to-chk=103/113) |
| call-graph-math-appr.gv            |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 1.30K                                 | 100% | 1.24MB/s   | 0:00:00 |   | 1.30K   | 100% | 1.24MB/s   | 0:00:00 | (xfr#10,  | to-chk=102/113) |
| call-graph-math-appr.gv.png        |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  12% | 31.25MB/s  | 0:00:00 |   | 269.69K | 100% | 64.30MB/s  | 0:00:00 | (xfr#11,  | to-chk=101/113) |
| call-graph-math-arr-matr.gv        |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 233                                   | 100% | 56.88kB/s  | 0:00:00 |   | 233     | 100% | 56.88kB/s  | 0:00:00 | (xfr#12,  | to-chk=100/113) |
| call-graph-math-arr-matr.gv.png    |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  68% | 7.81MB/s   | 0:00:00 |   | 47.91K  | 100% | 9.14MB/s   | 0:00:00 | (xfr#13,  | to-chk=99/113)  |
| call-graph-math-coord.gv           |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 141                                   | 100% | 27.54kB/s  | 0:00:00 |   | 141     | 100% | 27.54kB/s  | 0:00:00 | (xfr#14,  | to-chk=98/113)  |
| call-graph-math-coord.gv.png       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  62% | 6.25MB/s   | 0:00:00 |   | 52.83K  | 100% | 10.08MB/s  | 0:00:00 | (xfr#15,  | to-chk=97/113)  |
| call-graph-math-core.gv            |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 865                                   | 100% | 168.95kB/s | 0:00:00 |   | 865     | 100% | 168.95kB/s | 0:00:00 | (xfr#16,  | to-chk=96/113)  |
| call-graph-math-core.gv.png        |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  12% | 6.25MB/s   | 0:00:00 |   | 256.26K | 100% | 27.15MB/s  | 0:00:00 | (xfr#17,  | to-chk=95/113)  |
| call-graph-math-gnuplot.gv         |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 513                                   | 100% | 55.66kB/s  | 0:00:00 |   | 513     | 100% | 55.66kB/s  | 0:00:00 | (xfr#18,  | to-chk=94/113)  |
| call-graph-math-gnuplot.gv.png     |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  16% | 3.47MB/s   | 0:00:00 |   | 193.01K | 100% | 15.34MB/s  | 0:00:00 | (xfr#19,  | to-chk=93/113)  |
| call-graph-math-list-matr.gv       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 961                                   | 100% | 78.21kB/s  | 0:00:00 |   | 961     | 100% | 78.21kB/s  | 0:00:00 | (xfr#20,  | to-chk=92/113)  |
| call-graph-math-list-matr.gv.png   |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  11% | 2.60MB/s   | 0:00:00 |   | 281.37K | 100% | 19.17MB/s  | 0:00:00 | (xfr#21,  | to-chk=91/113)  |
| call-graph-math-smooth.gv          |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 637                                   | 100% | 41.47kB/s  | 0:00:00 |   | 637     | 100% | 41.47kB/s  | 0:00:00 | (xfr#22,  | to-chk=90/113)  |
| call-graph-math-smooth.gv.png      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  19% | 2.08MB/s   | 0:00:00 |   | 170.57K | 100% | 9.57MB/s   | 0:00:00 | (xfr#23,  | to-chk=89/113)  |
| call-graph-math-stat.gv            |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 1.95K                                 | 100% | 111.96kB/s | 0:00:00 |   | 1.95K   | 100% | 111.96kB/s | 0:00:00 | (xfr#24,  | to-chk=88/113)  |
| call-graph-math-stat.gv.png        |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |   4% | 1.84MB/s   | 0:00:00 |   | 708.72K | 100% | 16.90MB/s  | 0:00:00 | (xfr#25,  | to-chk=87/113)  |
| call-graph-math-x-o.gv             |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 576                                   | 100% | 14.06kB/s  | 0:00:00 |   | 576     | 100% | 14.06kB/s  | 0:00:00 | (xfr#26,  | to-chk=86/113)  |
| call-graph-math-x-o.gv.png         |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  27% | 800.00kB/s | 0:00:00 |   | 121.13K | 100% | 2.82MB/s   | 0:00:00 | (xfr#27,  | to-chk=85/113)  |
| call-graph-math.gv                 |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 279                                   | 100% | 6.65kB/s   | 0:00:00 |   | 279     | 100% | 6.65kB/s   | 0:00:00 | (xfr#28,  | to-chk=84/113)  |
| call-graph-math.gv.png             |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  66% | 780.49kB/s | 0:00:00 |   | 49.09K  | 100% | 1.11MB/s   | 0:00:00 | (xfr#29,  | to-chk=83/113)  |
| class-graph-math-appr.gv           |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 79                                    | 100% | 1.84kB/s   | 0:00:00 |   | 79      | 100% | 1.84kB/s   | 0:00:00 | (xfr#30,  | to-chk=82/113)  |
| class-graph-math-appr.gv.png       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 19.03K                                | 100% | 442.48kB/s | 0:00:00 |   | 19.03K  | 100% | 442.48kB/s | 0:00:00 | (xfr#31,  | to-chk=81/113)  |
| class-graph-math-arr-matr.gv       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 93                                    | 100% | 2.16kB/s   | 0:00:00 |   | 93      | 100% | 2.16kB/s   | 0:00:00 | (xfr#32,  | to-chk=80/113)  |
| class-graph-math-arr-matr.gv.png   |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 11.61K                                | 100% | 269.95kB/s | 0:00:00 |   | 11.61K  | 100% | 269.95kB/s | 0:00:00 | (xfr#33,  | to-chk=79/113)  |
| class-graph-math-coord.gv          |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 1.05kB/s   | 0:00:00 |   | 45      | 100% | 1.05kB/s   | 0:00:00 | (xfr#34,  | to-chk=78/113)  |
| class-graph-math-coord.gv.png      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 2.70kB/s   | 0:00:00 |   | 116     | 100% | 2.70kB/s   | 0:00:00 | (xfr#35,  | to-chk=77/113)  |
| class-graph-math-core.gv           |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 1.05kB/s   | 0:00:00 |   | 45      | 100% | 1.05kB/s   | 0:00:00 | (xfr#36,  | to-chk=76/113)  |
| class-graph-math-core.gv.png       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 2.70kB/s   | 0:00:00 |   | 116     | 100% | 2.70kB/s   | 0:00:00 | (xfr#37,  | to-chk=75/113)  |
| class-graph-math-gnuplot.gv        |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 209                                   | 100% | 4.86kB/s   | 0:00:00 |   | 209     | 100% | 4.86kB/s   | 0:00:00 | (xfr#38,  | to-chk=74/113)  |
| class-graph-math-gnuplot.gv.png    |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  69% | 761.90kB/s | 0:00:00 |   | 47.09K  | 100% | 1.04MB/s   | 0:00:00 | (xfr#39,  | to-chk=73/113)  |
| class-graph-math-list-matr.gv      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 1.02kB/s   | 0:00:00 |   | 45      | 100% | 1.02kB/s   | 0:00:00 | (xfr#40,  | to-chk=72/113)  |
| class-graph-math-list-matr.gv.png  |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 2.63kB/s   | 0:00:00 |   | 116     | 100% | 2.63kB/s   | 0:00:00 | (xfr#41,  | to-chk=71/113)  |
| class-graph-math-smooth.gv         |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 1.02kB/s   | 0:00:00 |   | 45      | 100% | 1.02kB/s   | 0:00:00 | (xfr#42,  | to-chk=70/113)  |
| class-graph-math-smooth.gv.png     |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 2.63kB/s   | 0:00:00 |   | 116     | 100% | 2.63kB/s   | 0:00:00 | (xfr#43,  | to-chk=69/113)  |
| class-graph-math-stat.gv           |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 1.02kB/s   | 0:00:00 |   | 45      | 100% | 1.02kB/s   | 0:00:00 | (xfr#44,  | to-chk=68/113)  |
| class-graph-math-stat.gv.png       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 2.63kB/s   | 0:00:00 |   | 116     | 100% | 2.63kB/s   | 0:00:00 | (xfr#45,  | to-chk=67/113)  |
| class-graph-math-x-o.gv            |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 51                                    | 100% | 1.16kB/s   | 0:00:00 |   | 51      | 100% | 1.16kB/s   | 0:00:00 | (xfr#46,  | to-chk=66/113)  |
| class-graph-math-x-o.gv.png        |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 3.32K                                 | 100% | 75.45kB/s  | 0:00:00 |   | 3.32K   | 100% | 75.45kB/s  | 0:00:00 | (xfr#47,  | to-chk=65/113)  |
| class-graph-math.gv                |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 1.02kB/s   | 0:00:00 |   | 45      | 100% | 1.02kB/s   | 0:00:00 | (xfr#48,  | to-chk=64/113)  |
| class-graph-math.gv.png            |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 2.63kB/s   | 0:00:00 |   | 116     | 100% | 2.63kB/s   | 0:00:00 | (xfr#49,  | to-chk=63/113)  |
| math-appr.html                     |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  72% | 744.19kB/s | 0:00:00 |   | 45.41K  | 100% | 1.01MB/s   | 0:00:00 | (xfr#50,  | to-chk=62/113)  |
| math-arr-matr.html                 |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 18.11K                                | 100% | 411.36kB/s | 0:00:00 |   | 18.11K  | 100% | 411.36kB/s | 0:00:00 | (xfr#51,  | to-chk=61/113)  |
| math-coord.html                    |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 10.91K                                | 100% | 247.73kB/s | 0:00:00 |   | 10.91K  | 100% | 247.73kB/s | 0:00:00 | (xfr#52,  | to-chk=60/113)  |
| math-core.html                     |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 25.33K                                | 100% | 575.33kB/s | 0:00:00 |   | 25.33K  | 100% | 575.33kB/s | 0:00:00 | (xfr#53,  | to-chk=59/113)  |
| math-gnuplot.html                  |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 13.87K                                | 100% | 315.09kB/s | 0:00:00 |   | 13.87K  | 100% | 315.09kB/s | 0:00:00 | (xfr#54,  | to-chk=58/113)  |
| math-list-matr.html                |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 20.74K                                | 100% | 460.29kB/s | 0:00:00 |   | 20.74K  | 100% | 460.29kB/s | 0:00:00 | (xfr#55,  | to-chk=57/113)  |
| math-smooth.html                   |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 8.57K                                 | 100% | 190.23kB/s | 0:00:00 |   | 8.57K   | 100% | 190.23kB/s | 0:00:00 | (xfr#56,  | to-chk=56/113)  |
| math-stat.html                     |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 18.50K                                | 100% | 410.71kB/s | 0:00:00 |   | 18.50K  | 100% | 410.71kB/s | 0:00:00 | (xfr#57,  | to-chk=55/113)  |
| math-x-o.html                      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 7.18K                                 | 100% | 159.42kB/s | 0:00:00 |   | 7.18K   | 100% | 159.42kB/s | 0:00:00 | (xfr#58,  | to-chk=54/113)  |
| math.html                          |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 9.43K                                 | 100% | 209.32kB/s | 0:00:00 |   | 9.43K   | 100% | 209.32kB/s | 0:00:00 | (xfr#59,  | to-chk=53/113)  |
| symbol-graph-math-appr.gv          |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 675                                   | 100% | 14.98kB/s  | 0:00:00 |   | 675     | 100% | 14.98kB/s  | 0:00:00 | (xfr#60,  | to-chk=52/113)  |
| symbol-graph-math-appr.gv.png      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  17% | 727.27kB/s | 0:00:00 |   | 188.81K | 100% | 3.00MB/s   | 0:00:00 | (xfr#61,  | to-chk=51/113)  |
| symbol-graph-math-arr-matr.gv      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 176                                   | 100% | 2.86kB/s   | 0:00:00 |   | 176     | 100% | 2.86kB/s   | 0:00:00 | (xfr#62,  | to-chk=50/113)  |
| symbol-graph-math-arr-matr.gv.png  |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.05K                                | 100% | 521.61kB/s | 0:00:00 |   | 32.05K  | 100% | 521.61kB/s | 0:00:00 | (xfr#63,  | to-chk=49/113)  |
| symbol-graph-math-coord.gv         |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 0.73kB/s   | 0:00:00 |   | 45      | 100% | 0.73kB/s   | 0:00:00 | (xfr#64,  | to-chk=48/113)  |
| symbol-graph-math-coord.gv.png     |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 1.89kB/s   | 0:00:00 |   | 116     | 100% | 1.89kB/s   | 0:00:00 | (xfr#65,  | to-chk=47/113)  |
| symbol-graph-math-core.gv          |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 214                                   | 100% | 3.48kB/s   | 0:00:00 |   | 214     | 100% | 3.48kB/s   | 0:00:00 | (xfr#66,  | to-chk=46/113)  |
| symbol-graph-math-core.gv.png      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  87% | 533.33kB/s | 0:00:00 |   | 37.35K  | 100% | 597.99kB/s | 0:00:00 | (xfr#67,  | to-chk=45/113)  |
| symbol-graph-math-gnuplot.gv       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 525                                   | 100% | 8.40kB/s   | 0:00:00 |   | 525     | 100% | 8.40kB/s   | 0:00:00 | (xfr#68,  | to-chk=44/113)  |
| symbol-graph-math-gnuplot.gv.png   |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  25% | 524.59kB/s | 0:00:00 |   | 128.00K | 100% | 1.88MB/s   | 0:00:00 | (xfr#69,  | to-chk=43/113)  |
| symbol-graph-math-list-matr.gv     |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 0.68kB/s   | 0:00:00 |   | 45      | 100% | 0.68kB/s   | 0:00:00 | (xfr#70,  | to-chk=42/113)  |
| symbol-graph-math-list-matr.gv.png |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 1.74kB/s   | 0:00:00 |   | 116     | 100% | 1.74kB/s   | 0:00:00 | (xfr#71,  | to-chk=41/113)  |
| symbol-graph-math-smooth.gv        |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 0.67kB/s   | 0:00:00 |   | 45      | 100% | 0.67kB/s   | 0:00:00 | (xfr#72,  | to-chk=40/113)  |
| symbol-graph-math-smooth.gv.png    |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 1.72kB/s   | 0:00:00 |   | 116     | 100% | 1.72kB/s   | 0:00:00 | (xfr#73,  | to-chk=39/113)  |
| symbol-graph-math-stat.gv          |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 82                                    | 100% | 1.21kB/s   | 0:00:00 |   | 82      | 100% | 1.21kB/s   | 0:00:00 | (xfr#74,  | to-chk=38/113)  |
| symbol-graph-math-stat.gv.png      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 9.11K                                 | 100% | 134.85kB/s | 0:00:00 |   | 9.11K   | 100% | 134.85kB/s | 0:00:00 | (xfr#75,  | to-chk=37/113)  |
| symbol-graph-math-x-o.gv           |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 189                                   | 100% | 2.80kB/s   | 0:00:00 |   | 189     | 100% | 2.80kB/s   | 0:00:00 | (xfr#76,  | to-chk=36/113)  |
| symbol-graph-math-x-o.gv.png       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  86% | 484.85kB/s | 0:00:00 |   | 37.95K  | 100% | 561.60kB/s | 0:00:00 | (xfr#77,  | to-chk=35/113)  |
| symbol-graph-math.gv               |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 0.67kB/s   | 0:00:00 |   | 45      | 100% | 0.67kB/s   | 0:00:00 | (xfr#78,  | to-chk=34/113)  |
| symbol-graph-math.gv.png           |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 1.72kB/s   | 0:00:00 |   | 116     | 100% | 1.72kB/s   | 0:00:00 | (xfr#79,  | to-chk=33/113)  |
| system-graph-math-appr.gv          |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 395                                   | 100% | 5.84kB/s   | 0:00:00 |   | 395     | 100% | 5.84kB/s   | 0:00:00 | (xfr#80,  | to-chk=32/113)  |
| system-graph-math-appr.gv.png      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  32% | 484.85kB/s | 0:00:00 |   | 101.95K | 100% | 1.45MB/s   | 0:00:00 | (xfr#81,  | to-chk=31/113)  |
| system-graph-math-arr-matr.gv      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 153                                   | 100% | 2.23kB/s   | 0:00:00 |   | 153     | 100% | 2.23kB/s   | 0:00:00 | (xfr#82,  | to-chk=30/113)  |
| system-graph-math-arr-matr.gv.png  |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 23.82K                                | 100% | 314.36kB/s | 0:00:00 |   | 23.82K  | 100% | 314.36kB/s | 0:00:00 | (xfr#83,  | to-chk=29/113)  |
| system-graph-math-coord.gv         |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 98                                    | 100% | 1.29kB/s   | 0:00:00 |   | 98      | 100% | 1.29kB/s   | 0:00:00 | (xfr#84,  | to-chk=28/113)  |
| system-graph-math-coord.gv.png     |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 12.43K                                | 100% | 163.97kB/s | 0:00:00 |   | 12.43K  | 100% | 163.97kB/s | 0:00:00 | (xfr#85,  | to-chk=27/113)  |
| system-graph-math-core.gv          |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 0.59kB/s   | 0:00:00 |   | 45      | 100% | 0.59kB/s   | 0:00:00 | (xfr#86,  | to-chk=26/113)  |
| system-graph-math-core.gv.png      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 1.51kB/s   | 0:00:00 |   | 116     | 100% | 1.51kB/s   | 0:00:00 | (xfr#87,  | to-chk=25/113)  |
| system-graph-math-gnuplot.gv       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 843                                   | 100% | 10.98kB/s  | 0:00:00 |   | 843     | 100% | 10.98kB/s  | 0:00:00 | (xfr#88,  | to-chk=24/113)  |
| system-graph-math-gnuplot.gv.png   |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  11% | 426.67kB/s | 0:00:00 |   | 283.03K | 100% | 3.37MB/s   | 0:00:00 | (xfr#89,  | to-chk=23/113)  |
| system-graph-math-list-matr.gv     |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 195                                   | 100% | 2.38kB/s   | 0:00:00 |   | 195     | 100% | 2.38kB/s   | 0:00:00 | (xfr#90,  | to-chk=22/113)  |
| system-graph-math-list-matr.gv.png |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  97% | 400.00kB/s | 0:00:00 |   | 33.50K  | 100% | 408.95kB/s | 0:00:00 | (xfr#91,  | to-chk=21/113)  |
| system-graph-math-smooth.gv        |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 45                                    | 100% | 0.55kB/s   | 0:00:00 |   | 45      | 100% | 0.55kB/s   | 0:00:00 | (xfr#92,  | to-chk=20/113)  |
| system-graph-math-smooth.gv.png    |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 116                                   | 100% | 1.42kB/s   | 0:00:00 |   | 116     | 100% | 1.42kB/s   | 0:00:00 | (xfr#93,  | to-chk=19/113)  |
| system-graph-math-stat.gv          |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 96                                    | 100% | 1.17kB/s   | 0:00:00 |   | 96      | 100% | 1.17kB/s   | 0:00:00 | (xfr#94,  | to-chk=18/113)  |
| system-graph-math-stat.gv.png      |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 11.87K                                | 100% | 144.89kB/s | 0:00:00 |   | 11.87K  | 100% | 144.89kB/s | 0:00:00 | (xfr#95,  | to-chk=17/113)  |
| system-graph-math-x-o.gv           |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 220                                   | 100% | 2.69kB/s   | 0:00:00 |   | 220     | 100% | 2.69kB/s   | 0:00:00 | (xfr#96,  | to-chk=16/113)  |
| system-graph-math-x-o.gv.png       |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |  79% | 400.00kB/s | 0:00:00 |   | 41.02K  | 100% | 494.59kB/s | 0:00:00 | (xfr#97,  | to-chk=15/113)  |
| system-graph-math.gv               |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 1.73K                                 | 100% | 20.86kB/s  | 0:00:00 |   | 1.73K   | 100% | 20.86kB/s  | 0:00:00 | (xfr#98,  | to-chk=14/113)  |
| system-graph-math.gv.png           |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 32.77K                                |   3% | 395.06kB/s | 0:00:02 |   | 925.06K | 100% | 8.82MB/s   | 0:00:00 | (xfr#99,  | to-chk=13/113)  |
| графы-math-appr.html               |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 7.08K                                 | 100% | 69.09kB/s  | 0:00:00 |   | 7.08K   | 100% | 69.09kB/s  | 0:00:00 | (xfr#100, | to-chk=12/113)  |
| графы-math-arr-matr.html           |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 7.05K                                 | 100% | 68.90kB/s  | 0:00:00 |   | 7.05K   | 100% | 68.90kB/s  | 0:00:00 | (xfr#101, | to-chk=11/113)  |
| графы-math-core.html               |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.89K                                 | 100% | 67.32kB/s  | 0:00:00 |   | 6.89K   | 100% | 67.32kB/s  | 0:00:00 | (xfr#102, | to-chk=10/113)  |
| графы-math-gnuplot.html            |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 7.16K                                 | 100% | 69.87kB/s  | 0:00:00 |   | 7.16K   | 100% | 69.87kB/s  | 0:00:00 | (xfr#103, | to-chk=9/113)   |
| графы-math-list-matr.html          |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.98K                                 | 100% | 68.17kB/s  | 0:00:00 |   | 6.98K   | 100% | 68.17kB/s  | 0:00:00 | (xfr#104, | to-chk=8/113)   |
| графы-math-stat.html               |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.90K                                 | 100% | 67.42kB/s  | 0:00:00 |   | 6.90K   | 100% | 67.42kB/s  | 0:00:00 | (xfr#105, | to-chk=7/113)   |
| графы-math-x-o.html                |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 7.12K                                 | 100% | 69.57kB/s  | 0:00:00 |   | 7.12K   | 100% | 69.57kB/s  | 0:00:00 | (xfr#106, | to-chk=6/113)   |
| графы-math.html                    |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.80K                                 | 100% | 66.45kB/s  | 0:00:00 |   | 6.80K   | 100% | 66.45kB/s  | 0:00:00 | (xfr#107, | to-chk=5/113)   |
| обзор.html                         |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 6.96K                                 | 100% | 67.97kB/s  | 0:00:00 |   | 6.96K   | 100% | 67.97kB/s  | 0:00:00 | (xfr#108, | to-chk=4/113)   |
| static/                            |                                       |      |            |         |   |         |      |            |         |           |                 |
| static/highlight.css               |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 1.57K                                 | 100% | 15.34kB/s  | 0:00:00 |   | 1.57K   | 100% | 15.34kB/s  | 0:00:00 | (xfr#109, | to-chk=2/113)   |
| static/highlight.js                |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 22.99K                                | 100% | 224.50kB/s | 0:00:00 |   | 22.99K  | 100% | 224.50kB/s | 0:00:00 | (xfr#110, | to-chk=1/113)   |
| static/style.css                   |                                       |      |            |         |   |         |      |            |         |           |                 |
|                                    | 4.32K                                 | 100% | 42.17kB/s  | 0:00:00 |   | 4.32K   | 100% | 42.17kB/s  | 0:00:00 | (xfr#111, | to-chk=0/113)   |
| mnasoft-00                         |                                       |      |            |         |   |         |      |            |         |           |                 |
